{
  "brand": "RutaCL",
  "tagline": "Explore Chile your way",
  "searchPlaceholder": "Where do you want to go?",
  "search": "Search",
  "login": "Sign in",
  "logout": "Log out",

  "whatYouCanDo": "What can you do on {{brand}}?",
  "hero_description": "Discover all the tools we have to help you plan the perfect trip through Chile.",
  "plan": "Plan your routes",
  "save": "Saved places",
  "costs": "Calculate costs",
  "plan_desc": "Add destinations, adjust the order, and view the full route.",
  "save_desc": "Create favorites or locations to revisit anytime.",
  "costs_desc": "Estimate tolls, fuel and public transport.",

  "welcome": "Welcome to {{brand}}",
  "error": "An error has occurred",
  "loading": "Loading...",
  "register": "Register",
  "email": "Email",
  "password": "Password",
  "confirmPassword": "Confirm password",
  "forgotPassword": "Forgot your password?",
  "profile": "Profile",
  "home": "Home",

  "hero_title": "Explore Chile your way",
  "search_placeholder": "Search for places in Chile...",

  "footerRights": "All rights reserved.",
  "footerAboutLink": "About us",
  "footerContactLink": "Contact",
  "footerAboutTitle": "About RutaCL",
  "footerAboutText": "We are two students from Universidad Adolfo Ibáñez who developed this platform as part of our Software Design project. RutaCL was created to make exploring Chile easier and more visual, bringing together highlighted places, trip ideas and tools that help you plan routes in a clear and intuitive way.",
  "footerContactTitle": "Contact",
  "footerContactText": "If you have suggestions or found a problem, you can email us at jojuica@alumnos.uai.cl and pfrancia@alumnos.uai.cl.",

  "plan_title": "Plan your trip route",
  "plan_subtitle": "Search and add Chilean cities, towns and localities to plan your route.",
  "plan_stops_title": "Trip stops",
  "plan_actions_title": "Quick actions",
  "plan_search_placeholder": "Search cities, towns, localities...",
  "plan_search_hint": "Only geographic locations in Chile are shown, not accommodations.",
  "plan_calc_costs": "Calculate costs",
  "plan_export_json": "Export route (JSON)",
  "plan_warning_too_few": "Add at least 2 destinations to generate an automatic itinerary.",
  "plan_warning_too_many": "The maximum number of destinations for an itinerary is 5.",
  "plan_generate_button": "Generate itinerary with AI",

  "favorites_title": "Saved places",
  "favorites_greeting": "Hi {{name}}, here you will see your favorites.",
  "favorites_empty": "You don't have any favorites yet. Add some from the search.",

  "costs_title": "Calculate your costs",
  "costs_subtitle": "Estimate fuel and tolls for your trip 🚗",
  "costs_distance_label": "Total distance (km)",
  "costs_distance_placeholder": "Ex: 350",
  "costs_efficiency_label": "Fuel efficiency (km/l)",
  "costs_price_label": "Fuel price ($/l)",
  "costs_tolls_label": "Tolls",
  "costs_tolls_placeholder": "Toll amount",
  "costs_add_toll": "Add toll",
  "costs_estimated_liters": "Estimated liters",
  "costs_estimated_fuel": "Fuel",
  "costs_estimated_tolls": "Tolls",
  "costs_total_estimated": "Total estimated",

  "auth": {
    "login_title": "Log in",
    "login_subtitle": "Access to continue.",
    "email_label": "Email",
    "email_placeholder": "your@email.com",
    "password_label": "Password",
    "show_password": "Show",
    "hide_password": "Hide",
    "remember_me": "Remember me",
    "forgot_password": "Forgot your password?",
    "forgot_password_help": "Please contact support to recover your password.",
    "submit_login": "Sign in",
    "submitting": "Signing in...",
    "no_account": "Don't have an account?",
    "go_register": "Create account",
    "or": "Or",

    "error_invalid_credentials": "Invalid credentials.",
    "error_missing_fields": "Please fill in all fields.",
    "error_generic": "An error has occurred.",
    "error_google": "Error authenticating with Google.",

    "register_title": "Create account",
    "register_subtitle": "Sign up to continue.",
    "name_label": "Full name",
    "confirm_password_label": "Confirm password",
    "creating_account": "Creating account...",
    "submit_register": "Create account",
    "have_account": "Already have an account?",
    "go_login": "Log in",

    "error_required_fields": "Please fill in all fields.",
    "error_password_length": "Password must be at least 6 characters long.",
    "error_password_mismatch": "Passwords do not match."
  },

  "plan_trip": "Plan trip",
  "search_again": "Search another place",
  "saved": "Saved",
  "save_button": "Save",
  "place_type_city": "City",
  "place_type_region": "Region",
  "search.no_results": "No results found.",
  "favorites_temp_title": "Your locally saved favorites",

  "place_desc_vina_del_mar": "Viña del Mar is a city located in Valparaíso, Chile, renowned for its beaches, temperate climate and coastal scenery. Perfect for enjoying the sea and relaxing.",
  "place_desc_valparaiso": "Valparaíso is a historic port city on Chile's central coast, famous for its colonial architecture, picturesque hills and vibrant cultural life.",
  "place_desc_santiago": "Santiago is the capital of Chile, located in the central valley. The country's political, economic and cultural center, surrounded by the Andes.",
  "place_desc_atacama": "The Atacama Desert is one of the most arid deserts in the world, featuring surreal landscapes, volcanoes and starry skies perfect for tourism.",
  "place_desc_torres_del_paine": "Torres del Paine is a national park in Chilean Patagonia, famous for its granite mountains, glaciers and world-class trekking trails.",
  "place_desc_moai": "Easter Island is famous for the mysterious Moái, monolithic statues of the ancient Rapa Nui culture. A unique destination in the Pacific Ocean.",
  "place_desc_maitencillo": "Maitencillo is a coastal locality located in Puchuncaví, Valparaíso, known for its peaceful beaches, natural pools and rural landscapes. Perfect for a relaxing getaway.",
  "place_desc_valdivia": "Valdivia is a city located in the Los Ríos region, known for its rivers, German colonial architecture and gastronomy. A historic and cultural destination in southern Chile.",
  "place_desc_puerto_varas": "Puerto Varas is a tourist city located in the Los Lagos region, famous for its German colonial houses, black sand beaches and views of Osorno.",
  "place_desc_puerto_montt": "Puerto Montt is the capital of the Los Lagos region, known for its historic port, seafood market, typical architecture and as a gateway to Patagonia.",
  "place_desc_osorno": "Osorno is a city located in Los Lagos, surrounded by lush nature and close to Osorno Volcano. Ideal for outdoor activities and adventure.",
  "place_desc_puerto_natales": "Puerto Natales is a small city located in Magallanes, gateway to Torres del Paine. Perfect for explorers and nature lovers.",
  "place_desc_punta_arenas": "Punta Arenas is the southernmost city in Chile, located in the Magallanes region. Starting point for Antarctic expeditions and adventure destination.",
  "place_desc_antofagasta": "Antofagasta is a port city located in northern Chile, close to the Atacama Desert. Known for its beaches and as a mining center.",
  "place_desc_iquique": "Iquique is a coastal city located in the extreme north of Chile, famous for its casino, beaches, nightlife and proximity to dunes and oases.",
  "place_desc_arica": "Arica is the northernmost city in Chile, located in the Atacama Desert. Offers beautiful beaches, tropical climate and archaeological heritage.",
  "place_desc_la_serena": "La Serena is a coastal city located in the Coquimbo region, known for its beaches, colonial architecture and as a center for astronomical observation.",
  "place_desc_coquimbo": "Coquimbo is a port city located next to La Serena, famous for the Monumental Lighthouse and its beaches. Important tourist and fishing destination.",
  "place_desc_rancagua": "Rancagua is the capital of the Libertador General Bernardo O'Higgins region, located in the central valley. Mining and industrial center of the country.",
  "place_desc_talca": "Talca is a city located in Maule, Chile's agricultural and wine-making center. Close to vineyards and offers wine tourism experiences.",
  "place_desc_concepcion": "Concepción is a city located in Biobío, an industrial and university center. Close to beaches and natural destinations in the region.",
  "place_desc_temuco": "Temuco is the capital of the Araucanía region, close to volcanoes, lakes and national parks. Cultural and historical center of the area.",
  "place_desc_villarrica": "Villarrica is a tourist town located in Araucanía, famous for Villarrica Volcano, crystal-clear lakes and adventure activities.",
  "place_desc_chillan": "Chillán is a city located in Ñuble, famous for its hot springs, market and as an access point to Chillán Volcano.",
  "place_desc_frutillar": "Frutillar is a picturesque town located in Los Lagos, known for its German architecture, theater, culture and views of Osorno Volcano.",
  "place_desc_puerto_octay": "Puerto Octay is a town located in Los Lagos, surrounded by nature, with access to lakes and volcanoes. Ideal for eco-tourism activities.",
  "place_desc_los_angeles": "Los Ángeles is a city located in Biobío, in the heart of Araucanía. Commercial and cultural center of the area, close to natural reserves.",
  
  "place_desc_calama": "Calama is a city located in the Atacama Desert, gateway to San Pedro de Atacama. Important mining center and base for exploring the arid north.",
  "place_desc_copiapo": "Copiapó is the capital of the Atacama region, located in the desert. Historic and cultural center with access to mining parks and arid landscapes.",
  "place_desc_ovalle": "Ovalle is a city located in Coquimbo, close to fertile valleys and beaches. Agricultural and gastronomic center with access to nearby destinations.",
  
  "place_desc_concon": "Concón is a beach located in Valparaíso, famous for its hot springs and eroded rocks. Perfect for enjoying the sea and nature.",
  "place_desc_papudo": "Papudo is a picturesque beach located in Valparaíso, known for its peace, tranquil beaches and relaxing atmosphere. Ideal for escaping mass tourism.",
  "place_desc_zapallar": "Zapallar is an exclusive beach located in Valparaíso, famous for its exclusivity, golden sand beaches and lush vegetation.",
  "place_desc_cachagua": "Cachagua is a beach located in Valparaíso, known for its natural beauty, Old Island with marine fauna and tranquil atmosphere.",
  "place_desc_quintero": "Quintero is a beach located in Valparaíso, with easy access from Santiago. Offers beautiful beaches and varied water activities.",
  "place_desc_algarrobo": "Algarrobo is a beach located in O'Higgins, famous for the Huaso Castle and its family-friendly beaches. Traditional tourist destination.",
  "place_desc_el_quisco": "El Quisco is a beach located in O'Higgins, close to Algarrobo. Known for its tranquil beaches and coastal town atmosphere.",
  "place_desc_cartagena": "Cartagena is a beach located in Valparaíso, with easy access from Santiago. Offers family beaches and classic summer atmosphere.",
  "place_desc_san_antonio": "San Antonio is a port located in O'Higgins, important fishing center. Offers port experience, seafood fairs and access to nearby beaches.",
  "place_desc_san_fernando": "San Fernando is a city located in O'Higgins, close to beaches and vineyards. Tourist center with access to rural and coastal landscapes.",
  
  "place_desc_curico": "Curicó is a city located in Maule, important agricultural and wine-making center. Base for exploring vineyards and rural valley landscapes.",
  "place_desc_talcahuano": "Talcahuano is a port located in Biobío, important industrial and fishing center. Access point to nearby coastal destinations.",
  "place_desc_tome": "Tomé is a beach located in Biobío, famous for its hot springs and artistic murals. Cultural destination with bohemian atmosphere.",
  "place_desc_lota": "Lota is a beach located in Biobío, with important mining history. Offers coastal landscapes and industrial heritage from the past.",
  "place_desc_tirua": "Tirúa is a beach located in Biobío, known for its tranquility and natural beauty. Ideal for rest and connection with nature.",
  
  "place_desc_pucon": "Pucón is a tourist town located in Araucanía, famous for Villarrica Volcano, Villarrica Lake and extreme adventure activities.",
  "place_desc_nacimiento": "Nacimiento is a city located in Biobío, close to natural reserves and parks with unique biodiversity.",
  "place_desc_corral": "Corral is a town located in Los Ríos, close to Valdivia. Known for its historic fort and panoramic views of the Calle-Calle river.",
  "place_desc_niebla": "Niebla is a town located in Los Ríos, at the mouth of the Calle-Calle River. Offers tranquil beaches and access to fluvial nature.",
  "place_desc_pucatrihue": "Pucatrihue is a beach located in Los Ríos, known for its natural beauty and tranquil atmosphere. Ideal for families seeking peace.",
  
  "place_desc_llanquihue": "Llanquihue is a city located in Los Lagos, close to beautiful lakes and volcanoes. Perfect for outdoor activities and nature tourism.",
  "place_desc_piedras_blancas": "Piedras Blancas is a beach located in Los Lagos, famous for its white rock formations and spectacular views of Osorno Volcano.",
  "place_desc_puyehue": "Puyehue is a locality located in Los Lagos, close to Puyehue National Park. Offers hot springs, lakes and access to natural reserves.",
  
  "place_desc_ancud": "Ancud is a city located in Chiloé, known for its historic fort, wooden churches and unique local gastronomy.",
  "place_desc_dalcahue": "Dalcahue is a town located in Chiloé, famous for its wooden church and traditional market with authentic local products.",
  "place_desc_castro": "Castro is the capital of Chiloé, located on a unique archipelago. Known for the San Francisco Church (UNESCO Heritage) and palafitos.",
  "place_desc_quellon": "Quellón is a town located south of Chiloé, starting point for the Carretera Austral. Offers authentic Chiloé experience and gastronomy.",
  
  "place_desc_puerto_williams": "Puerto Williams is the southernmost port in the world, located in Tierra del Fuego. Starting point for Antarctic expeditions and extreme adventures.",
  
  "place_desc_juan_fernandez": "Juan Fernández is an archipelago located in the Pacific, famous for its unique biodiversity and as the place where Robinson Crusoe lived.",
  "place_desc_archipelago": "The Chiloé Archipelago is a set of islands in Los Lagos, famous for its palafito architecture, wooden churches and unique culture.",
  "place_desc_pan_azucar": "Pan de Azúcar is a national park located in Antofagasta, known for its white sand dunes contrasting with rocky cliffs.",
  "place_desc_punta_choros": "Punta de Choros is a locality located in Coquimbo, gateway to protected islands with unique marine fauna like Humboldt penguins.",
  "place_desc_san_pedro_atacama": "San Pedro de Atacama is a town located in the heart of the Atacama Desert, base for exploring surreal landscapes and geysers."
}
