{
  "brand": "RutaCL",
  "tagline": "Explora Chile a tu manera",
  "searchPlaceholder": "쮸 d칩nde quieres ir?",
  "search": "Buscar",
  "login": "Iniciar sesi칩n",
  "logout": "Cerrar sesi칩n",

  "whatYouCanDo": "쯈u칠 puedes hacer en {{brand}}?",
  "hero_description": "Descubre todas las herramientas que tenemos para ayudarte a planificar el viaje perfecto por Chile.",
  "plan": "Planifica tus rutas",
  "save": "Lugares guardados",
  "costs": "Calcula los costos",
  "plan_desc": "Agrega destinos, ajusta el orden y visualiza el recorrido completo.",
  "save_desc": "Crea favoritos o pendientes y ret칩malos cuando quieras.",
  "costs_desc": "Estima peajes, combustible y transporte p칰blico.",

  "welcome": "Bienvenido a {{brand}}",
  "error": "Ha ocurrido un error",
  "loading": "Cargando...",
  "register": "Registrarse",
  "email": "Correo",
  "password": "Contrase침a",
  "confirmPassword": "Confirmar contrase침a",
  "forgotPassword": "쯆lvidaste tu contrase침a?",
  "profile": "Perfil",
  "home": "Inicio",

  "hero_title": "Explora Chile a tu manera",
  "search_placeholder": "Busca lugares en Chile...",

  "footerRights": "Todos los derechos reservados.",
  "footerAboutLink": "Sobre nosotros",
  "footerContactLink": "Contacto",
  "footerAboutTitle": "Sobre RutaCL",
  "footerAboutText": "Somos dos alumnas de la Universidad Adolfo Ib치침ez que desarrollamos esta plataforma como parte de nuestro proyecto de Dise침o de Software. RutaCL nace con la intenci칩n de facilitar la exploraci칩n de Chile de forma simple y visual, reuniendo lugares destacados, ideas de viaje y herramientas que permiten planificar rutas de manera clara, intuitiva y accesible para cualquier persona.",
  "footerContactTitle": "Contacto",
  "footerContactText": "Si tienes sugerencias o encontraste un problema, puedes escribirnos a jojuica@alumnos.uai.cl y pfrancia@alumnos.uai.cl.",

  "plan_title": "Planifica tu ruta de viaje",
  "plan_subtitle": "Busca y agrega ciudades, pueblos y localidades de Chile para planificar tu ruta.",
  "plan_stops_title": "Paradas del viaje",
  "plan_actions_title": "Acciones r치pidas",
  "plan_search_placeholder": "Busca ciudades, pueblos, localidades...",
  "plan_search_hint": "Solo se muestran lugares geogr치ficos de Chile, no alojamientos.",
  "plan_calc_costs": "Calcular costos",
  "plan_export_json": "Exportar ruta (JSON)",
  "plan_warning_too_few": "Agrega al menos 2 destinos para generar un itinerario autom치tico.",
  "plan_warning_too_many": "El m치ximo de destinos para generar un itinerario es 5.",
  "plan_generate_button": "Generar itinerario con IA",
  "plan_generating": "Generando...",
  "itinerary_title": "Itinerario Generado",
  "itinerary_departure": "Salida",
  "itinerary_time": "Tiempo",
  "itinerary_cost": "Costo",
  "itinerary_interesting_stops": "Paradas interesantes",
  "itinerary_cost_detail": "Detalle",
  "itinerary_tolls": "Peajes",
  "itinerary_fuel": "Combustible",
  "itinerary_other": "Otros",
  "itinerary_rain_alternatives": "Alternativas si llueve",
  "itinerary_summary": "Resumen del viaje",
  "itinerary_total_time": "Tiempo total",
  "itinerary_total_cost": "Costo total estimado",

  "favorites_title": "Lugares guardados",
  "favorites_greeting": "Hola {{name}}, aqu칤 ver치s tus favoritos.",
  "favorites_empty": "A칰n no tienes favoritos. Agrega algunos desde la b칰squeda.",

  "costs_title": "Calcula tus costos",
  "costs_subtitle": "Estima combustible y peajes de tu viaje 游뚱",
  "costs_distance_label": "Distancia total (km)",
  "costs_distance_placeholder": "Ej: 350",
  "costs_efficiency_label": "Rendimiento (km/l)",
  "costs_price_label": "Precio combustible ($/l)",
  "costs_tolls_label": "Peajes",
  "costs_tolls_placeholder": "Monto del peaje",
  "costs_add_toll": "Agregar peaje",
  "costs_estimated_liters": "Litros estimados",
  "costs_estimated_fuel": "Combustible",
  "costs_estimated_tolls": "Peajes",
  "costs_total_estimated": "Total estimado",

  "auth": {
    "login_title": "Iniciar sesi칩n",
    "login_subtitle": "Accede para continuar.",
    "email_label": "Correo",
    "email_placeholder": "tu@email.com",
    "password_label": "Contrase침a",
    "show_password": "Mostrar",
    "hide_password": "Ocultar",
    "remember_me": "Recordarme",
    "forgot_password": "쯆lvidaste tu contrase침a?",
    "forgot_password_help": "Por favor contacta a soporte para recuperar tu contrase침a.",
    "submit_login": "Entrar",
    "submitting": "Accediendo...",
    "no_account": "쯅o tienes cuenta?",
    "go_register": "Crear cuenta",
    "or": "O",

    "error_invalid_credentials": "Credenciales inv치lidas.",
    "error_missing_fields": "Completa todos los campos.",
    "error_generic": "Ha ocurrido un error.",
    "error_google": "Error al autenticar con Google.",

    "register_title": "Crear cuenta",
    "register_subtitle": "Reg칤strate para continuar.",
    "name_label": "Nombre completo",
    "confirm_password_label": "Confirmar contrase침a",
    "creating_account": "Creando cuenta...",
    "submit_register": "Crear cuenta",
    "have_account": "쯏a tienes cuenta?",
    "go_login": "Iniciar sesi칩n",

    "error_required_fields": "Completa todos los campos.",
    "error_password_length": "La contrase침a debe tener al menos 6 caracteres.",
    "error_password_mismatch": "Las contrase침as no coinciden."
  },

  "plan_trip": "Planificar viaje",
  "search_again": "Buscar otro lugar",
  "saved": "Guardado",
  "save_button": "Guardar",
  "place_type_city": "Ciudad",
  "place_type_region": "Regi칩n",
  "search.no_results": "No se encontraron resultados.",
  "favorites_temp_title": "Tus favoritos guardados localmente",

  "place_desc_vina_del_mar": "Vi침a del Mar es ciudad ubicada en Valpara칤so, Chile, reconocida por sus playas, clima templado y paisajes costeros. Ideal para disfrutar del mar y relajarse.",
  "place_desc_valparaiso": "Valpara칤so es una ciudad puerto hist칩rica en la costa central de Chile, famosa por su arquitectura colonial, cerros pintorescos y su vibrante vida cultural.",
  "place_desc_santiago": "Santiago es la capital de Chile, ubicada en el valle central. Centro pol칤tico, econ칩mico y cultural del pa칤s, rodeado por los Andes.",
  "place_desc_atacama": "El Desierto de Atacama es uno de los desiertos m치s 치ridos del mundo, con paisajes surrealistas, volcanes y cielos estrellados ideales para el turismo.",
  "place_desc_torres_del_paine": "Torres del Paine es un parque nacional en la Patagonia chilena, famoso por sus monta침as de granito, glaciares y senderos de trekking de clase mundial.",
  "place_desc_moai": "Isla de Pascua es famosa por los misteriosos Mo치i, estatuas monol칤ticas de la antigua cultura Rapa Nui. Un destino 칰nico en el Oc칠ano Pac칤fico.",
  "place_desc_maitencillo": "Maitencillo es una localidad costera ubicada en Puchuncav칤, Valpara칤so, conocida por sus playas tranquilas, piscinas naturales y paisajes rurales. Perfecta para un descanso relajado.",
  "place_desc_valdivia": "Valdivia es una ciudad ubicada en la regi칩n de Los R칤os, conocida por sus r칤os, arquitectura colonial alemana y gastronom칤a. Un destino hist칩rico y cultural en el sur de Chile.",
  "place_desc_puerto_varas": "Puerto Varas es una ciudad tur칤stica ubicada en la regi칩n de Los Lagos, famosa por sus casas coloniales alemanas, playas de arena negra y vistas al Osorno.",
  "place_desc_puerto_montt": "Puerto Montt es la capital de la regi칩n de Los Lagos, conocida por su puerto hist칩rico, mercado de mariscos, arquitectura t칤pica y como puerta de entrada a la Patagonia.",
  "place_desc_osorno": "Osorno es una ciudad ubicada en Los Lagos, rodeada de naturaleza exuberante y cercana al Volc치n Osorno. Ideal para actividades al aire libre y aventura.",
  "place_desc_puerto_natales": "Puerto Natales es una peque침a ciudad ubicada en Magallanes, puerta de entrada a Torres del Paine. Perfecta para exploradores y amantes de la naturaleza.",
  "place_desc_punta_arenas": "Punta Arenas es la ciudad m치s austral de Chile, ubicada en la regi칩n de Magallanes. Punto de partida para expediciones a la Ant치rtida y destino de aventura.",
  "place_desc_antofagasta": "Antofagasta es una ciudad portuaria ubicada en el norte de Chile, cercana al Desierto de Atacama. Conocida por sus playas y como centro minero.",
  "place_desc_iquique": "Iquique es una ciudad costera ubicada en el extremo norte de Chile, famosa por su casino, playas, vida nocturna y proximidad a dunas y oasis.",
  "place_desc_arica": "Arica es la ciudad m치s septentrional de Chile, ubicada en el Desierto de Atacama. Ofrece playas hermosas, clima tropical y patrimonio arqueol칩gico.",
  "place_desc_la_serena": "La Serena es una ciudad costera ubicada en la regi칩n de Coquimbo, conocida por sus playas, arquitectura colonial y como centro de observaci칩n astron칩mica.",
  "place_desc_coquimbo": "Coquimbo es una ciudad portuaria ubicada junto a La Serena, famosa por el Faro de Monumental y sus playas. Destino tur칤stico y pesquero importante.",
  "place_desc_rancagua": "Rancagua es la capital de la regi칩n del Libertador General Bernardo O'Higgins, ubicada en el valle central. Centro minero e industrial del pa칤s.",
  "place_desc_talca": "Talca es una ciudad ubicada en el Maule, centro agr칤cola y vitivin칤cola de Chile. Cercana a vi침edos y ofrece experiencias de enoturismo.",
  "place_desc_concepcion": "Concepci칩n es una ciudad ubicada en el Biob칤o, centro industrial y universitario. Cercana a playas y destinos naturales de la regi칩n.",
  "place_desc_temuco": "Temuco es la capital de la regi칩n de La Araucan칤a, cercana a volcanes, lagos y parques nacionales. Centro cultural e hist칩rico de la zona.",
  "place_desc_villarrica": "Villarrica es un pueblo tur칤stico ubicado en La Araucan칤a, famoso por el Volc치n Villarrica, lagos cristalinos y actividades de aventura.",
  "place_desc_chillan": "Chill치n es una ciudad ubicada en el 칌uble, famosa por sus aguas termales, mercado y como punto de acceso al Volc치n Chill치n.",
  "place_desc_frutillar": "Frutillar es un pueblo pintoresco ubicado en Los Lagos, conocido por su arquitectura alemana, teatro, cultura y vistas al Volc치n Osorno.",
  "place_desc_puerto_octay": "Puerto Octay es un pueblo ubicado en Los Lagos, rodeado de naturaleza, con acceso a lakes y volcanes. Ideal para actividades ecotur칤sticas.",
  "place_desc_los_angeles": "Los 츼ngeles es una ciudad ubicada en Biob칤o, en el coraz칩n de la Araucan칤a. Centro comercial y cultural de la zona, cercana a reservas naturales.",
  
  "place_desc_calama": "Calama es una ciudad ubicada en el desierto de Atacama, puerta de entrada a San Pedro de Atacama. Centro minero importante y base para explorar el norte des칠rtico.",
  "place_desc_copiapo": "Copiap칩 es la capital de la regi칩n de Atacama, ubicada en el desierto. Centro hist칩rico y cultural con acceso a parques mineros y paisajes 치ridos.",
  "place_desc_ovalle": "Ovalle es una ciudad ubicada en Coquimbo, cercana a valles fruct칤feros y playas. Centro agr칤cola y gastron칩mico con acceso a destinos cercanos.",
  
  "place_desc_concon": "Conc칩n es una playa ubicada en Valpara칤so, famosa por sus aguas termales y rocas erosionadas. Perfecta para disfrutar del mar y la naturaleza.",
  "place_desc_papudo": "Papudo es una playa pintoresca ubicada en Valpara칤so, conocida por su paz, playas tranquilas y ambiente relajante. Ideal para descansar lejos del turismo masivo.",
  "place_desc_zapallar": "Zapallar es una exclusiva playa ubicada en Valpara칤so, famosa por su exclusividad, playas de arena dorada y vegetaci칩n exuberante.",
  "place_desc_cachagua": "Cachagua es una playa ubicada en Valpara칤so, conocida por su belleza natural, Islote La Vieja con fauna marina y ambiente tranquilo.",
  "place_desc_quintero": "Quintero es una playa ubicada en Valpara칤so, con acceso f치cil desde Santiago. Ofrece playas hermosas y actividades acu치ticas variadas.",
  "place_desc_algarrobo": "Algarrobo es una playa ubicada en O'Higgins, famosa por el Castillo del Huaso y sus playas con atm칩sfera familiar. Destino tur칤stico tradicional.",
  "place_desc_el_quisco": "El Quisco es una playa ubicada en O'Higgins, cercana a Algarrobo. Conocida por sus playas tranquilas y ambiente de pueblo costero.",
  "place_desc_cartagena": "Cartagena es una playa ubicada en Valpara칤so, con acceso f치cil desde Santiago. Ofrece playas familiares y atm칩sfera veraniega cl치sica.",
  "place_desc_san_antonio": "San Antonio es un puerto ubicado en O'Higgins, importante centro pesquero. Ofrece experiencia portuaria, ferias de mariscos y acceso a playas cercanas.",
  "place_desc_san_fernando": "San Fernando es una ciudad ubicada en O'Higgins, cercana a playas y vi침edos. Centro tur칤stico con acceso a paisajes rurales y costeros.",
  
  "place_desc_curico": "Curic칩 es una ciudad ubicada en el Maule, centro agr칤cola y vitivin칤cola importante. Base para explorar vi침edos y paisajes rurales del valle.",
  "place_desc_talcahuano": "Talcahuano es un puerto ubicado en Biob칤o, importante centro industrial y pesquero. Punto de acceso a destinos costeros cercanos.",
  "place_desc_tome": "Tom칠 es una playa ubicada en Biob칤o, famosa por sus aguas termales y murales art칤sticos. Destino cultural con atm칩sfera bohemia.",
  "place_desc_lota": "Lota es una playa ubicada en Biob칤o, con historia minera importante. Ofrece paisajes costeros y patrimonio industrial del pasado.",
  "place_desc_tirua": "Tir칰a es una playa ubicada en Biob칤o, conocida por su tranquilidad y belleza natural. Ideal para descanso y conexi칩n con la naturaleza.",
  
  "place_desc_pucon": "Puc칩n es un pueblo tur칤stico ubicado en La Araucan칤a, famoso por el Volc치n Villarrica, lago Villarrica y actividades de aventura extrema.",
  "place_desc_nacimiento": "Nacimiento es una ciudad ubicada en Biob칤o, cercana a reservas naturales y parques con biodiversidad 칰nica.",
  "place_desc_corral": "Corral es un pueblo ubicado en Los R칤os, cercano a Valdivia. Conocido por su fuerte hist칩rico y vistas panor치micas del r칤o Calle-Calle.",
  "place_desc_niebla": "Niebla es un pueblo ubicado en Los R칤os, en la desembocadura del R칤o Calle-Calle. Ofrece playas tranquilas y acceso a la naturaleza fluvial.",
  "place_desc_pucatrihue": "Pucatrihue es una playa ubicada en Los R칤os, conocida por su belleza natural y ambiente tranquilo. Ideal para familias que buscan paz.",
  
  "place_desc_llanquihue": "Llanquihue es una ciudad ubicada en Los Lagos, cercana a hermosos lagos y volcanes. Perfecta para actividades al aire libre y turismo de naturaleza.",
  "place_desc_piedras_blancas": "Piedras Blancas es una playa ubicada en Los Lagos, famosa por sus formaciones rocosas blancas y vistas espectaculares del Volc치n Osorno.",
  "place_desc_puyehue": "Puyehue es una localidad ubicada en Los Lagos, cercana al Parque Nacional Puyehue. Ofrece aguas termales, lagos y acceso a reservas naturales.",
  
  "place_desc_ancud": "Ancud es una ciudad ubicada en Chilo칠, conocida por su fuerte hist칩rico, iglesias de madera y gastronom칤a local 칰nica.",
  "place_desc_dalcahue": "Dalcahue es un pueblo ubicado en Chilo칠, famoso por su iglesia de madera y mercado tradicional con productos locales aut칩ctonos.",
  "place_desc_castro": "Castro es la capital de Chilo칠, ubicada en un archipi칠lago 칰nico. Conocida por la Iglesia de San Francisco (Patrimonio UNESCO) y palafitos.",
  "place_desc_quellon": "Quell칩n es un pueblo ubicado al sur de Chilo칠, punto de partida para la Carretera Austral. Ofrece experiencia aut칠ntica de Chilo칠 y gastronom칤a.",
  
  "place_desc_puerto_williams": "Puerto Williams es el puerto m치s meridional del mundo, ubicado en Tierra del Fuego. Punto de partida para expediciones ant치rticas y aventuras extremas.",
  
  "place_desc_juan_fernandez": "Juan Fern치ndez es un archipi칠lago ubicado en el Pac칤fico, famoso por su biodiversidad 칰nica y como lugar donde vivi칩 Robinson Crusoe.",
  "place_desc_archipelago": "El Archipi칠lago de Chilo칠 es un conjunto de islas en Los Lagos, famosas por su arquitectura de palafitos, iglesias de madera y cultura 칰nica.",
  "place_desc_pan_azucar": "Pan de Az칰car es un parque nacional ubicado en Antofagasta, conocido por sus dunas de arena blanca contrastando con acantilados rocosos.",
  "place_desc_punta_choros": "Punta de Choros es una localidad ubicada en Coquimbo, puerta de entrada a islas protegidas con fauna marina unique como ping칲inos de Humboldt.",
  "place_desc_san_pedro_atacama": "San Pedro de Atacama es un pueblo ubicado en el coraz칩n del desierto de Atacama, base para explorar paisajes surrealistas y g칠iseres."
}
